
<?php

$data = array();
$data['id'] = [1, 2, 3, 4];
$data['name'] = ['Торт «Молочная девочка»', 'Шоколадный торт «Стаканчиковый» с творожно-сметанным кремом', 'Торт "Бисквитное чудо"', 'Торт "Сникерс"'];
$data['desc'] = ['Необычайно нежный и вкусный торт «Молочная девочка» приготовить очень быстро и просто. Этот рецепт не займет много вашего времени и усилий, зато результат порадует всех. Нежные, мягкие коржи на сгущенном молоке в сочетании с кремом из сливок и сгущенки, по вкусу напоминающим сливочное мороженое. Перед этим тортом устоять невозможно!', 'Очень вкусный и нежный шоколадный торт «Стаканчиковый», который можно приготовить без использования весов. Торт очень простой в приготовлении, его можно очень быстро сделать в домашних условиях, ведь, скорее всего, все ингредиенты уже есть у Вас в холодильнике. Коржи получаются влажными и пористыми. Крем нежный и воздушный, а глазурь мегашоколадная!', 'Такой лёгкий, вкусный и быстрый бисквитный тортик со сметанным кремом и бананами спасёт любую хозяйку за полчаса!', 'Вкусный, очень сытный, мегашоколадный торт "Сникерс" с арахисом и солёной карамелью.'];
$data['img_link'] = ['https://img1.russianfood.com/dycontent/images_upl/351/sm_350741.jpg', 'https://img1.russianfood.com/dycontent/images_upl/412/sm_411422.jpg', 'https://img1.russianfood.com/dycontent/images_upl/106/sm_105578.jpg', 'https://img1.russianfood.com/dycontent/images_upl/290/sm_289521.jpg'];
$data['real_count'] = [13, 6, 8, 10];
$data['struct'] = ['молоко сгущенное, яйца, соль, мука пшеничная, разрыхлитель, масло сливочное, сливки, молоко сгущенное, сахар ванильный, ягоды свежи', 'кефир, яйца, сахар, мука, разрыхлитель, какао-порошок, масло растительное, соль, творог, сметана, сахар, сахар ванильный, сметана, сахар, какао-порошок, масло сливочное', 'яйца, мука, сахар, сахар, сахар ванильный, разрыхлитель, какао-порошок, банан, сметана', 'мука, яйца, сахар, какао-порошок, масло растительное, молоко, кофе растворимый, кипяток, разрыхлитель, сода, шоколад черный, сливки, молоко'];
$data['price'] = [950, 1200, 1050, 1100];

?>