
create table users(
    id int primary key auto_increment,
    login varchar(20),
    password varchar(32)
);

drop table products;
create table products(
    id int primary key auto_increment,
    name varchar(100),
    `desc` text,
    img_link text,
    real_count int,
    struct text,
    price int
);


create table buy(
	id int PRIMARY KEY AUTO_INCREMENT,
    user_id int,
    product_id int,
    
    FOREIGN KEY (user_id) REFERENCES users (id),
    FOREIGN KEY (product_id) REFERENCES products (id)
);


insert into products (price, name, `desc`, img_link, real_count, struct)
values
(1050, 'Торт «Молочная девочка»', 'Необычайно нежный и вкусный торт «Молочная девочка» приготовить очень быстро и просто. Этот рецепт не займет много вашего времени и усилий, зато результат порадует всех. Нежные, мягкие коржи на сгущенном молоке в сочетании с кремом из сливок и сгущенки, по вкусу напоминающим сливочное мороженое. Перед этим тортом устоять невозможно!', 'https://img1.russianfood.com/dycontent/images_upl/351/sm_350741.jpg', 13, 'молоко сгущенное, яйца, соль, мука пшеничная, разрыхлитель, масло сливочное, сливки, молоко сгущенное, сахар ванильный, ягоды свежи'),
(950, 'Шоколадный торт «Стаканчиковый» с творожно-сметанным кремом', 'Очень вкусный и нежный шоколадный торт «Стаканчиковый», который можно приготовить без использования весов. Торт очень простой в приготовлении, его можно очень быстро сделать в домашних условиях, ведь, скорее всего, все ингредиенты уже есть у Вас в холодильнике. Коржи получаются влажными и пористыми. Крем нежный и воздушный, а глазурь мегашоколадная!', 'https://img1.russianfood.com/dycontent/images_upl/412/sm_411422.jpg', 6, 'кефир, яйца, сахар, мука, разрыхлитель, какао-порошок, масло растительное, соль, творог, сметана, сахар, сахар ванильный, сметана, сахар, какао-порошок, масло сливочное'),
(1100, 'Торт "Бисквитное чудо"', 'Такой лёгкий, вкусный и быстрый бисквитный тортик со сметанным кремом и бананами спасёт любую хозяйку за полчаса!', 'https://img1.russianfood.com/dycontent/images_upl/106/sm_105578.jpg', 8, 'яйца, мука, сахар, сахар, сахар ванильный, разрыхлитель, какао-порошок, банан, сметана'),
(1200, 'Торт "Сникерс"', 'Вкусный, очень сытный, мегашоколадный торт "Сникерс" с арахисом и солёной карамелью.', 'https://img1.russianfood.com/dycontent/images_upl/290/sm_289521.jpg', 10, 'мука, яйца, сахар, какао-порошок, масло растительное, молоко, кофе растворимый, кипяток, разрыхлитель, сода, шоколад черный, сливки, молоко');